artillery-config.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 10
      name: Load testing
    - duration: 60
      arrivalRate: 20
      name: Stress testing
    - duration: 30
      arrivalRate: 5
      name: Cool down
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'User login and dashboard access'
    weight: 40
    flow:
      - post:
          url: '/api/auth/login'
          json:
            username: 'testuser'
            password: 'testpass'
          expect:
            - statusCode: 200
          capture:
            json: '$.token'
            as: 'auth_token'
      - get:
          url: '/api/dashboard'
          headers:
            Authorization: 'Bearer {{ auth_token }}'
          expect:
            - statusCode: 200

  - name: 'GST compliance check'
    weight: 30
    flow:
      - post:
          url: '/api/gst/validate'
          json:
            invoice_data:
              amount: 10000
              gst_rate: 18
          expect:
            - statusCode: 200

  - name: 'Financial report generation'
    weight: 20
    flow:
      - get:
          url: '/api/reports/financial?period=monthly'
          expect:
            - statusCode: 200
          afterResponse: 'checkResponseTime'

  - name: 'Ledger operations'
    weight: 10
    flow:
      - post:
          url: '/api/ledgers'
          json:
            name: 'Test Ledger {{ $randomInt }}'
            type: 'asset'
          expect:
            - statusCode: 201

beforeRequest:
  - log: 'Starting request to {{ request.url }}'

afterResponse:
  - log: 'Response time: {{ response.timings.phases.total }}ms'

plugins:
  ensure: {}
  apdex:
    threshold: 500
  metrics-by-endpoint: {}

ensure:
  thresholds:
    - http.response_time.p99: 1000
    - http.response_time.p95: 500
  conditions:
    - expression: 'http.response_time.p99 < 2000'
      strict: false